<h2>okay let's discuss about pandas.</h2>

<h1>What is Pandas in python?</h1>

you can use pandas to manipulate and analyze data. It provides different data structures and operations to manipulate and analyze time series and numerical tables.The author of the pandas is Mr.Wes McKinney.

Pandas is under a three-clause BSD license and is free to download, use, and distribute.
Etymologically, the term is a portmanteau of the words “panel” and “data”.
What this means is that you need to supervise data sets multiple times for one individual.

<h1>Operating on Data in Pandas</h1>
<ul><li>One of the essential pieces of NumPy is the ability to perform quick element-wise operations, both with basic arithmetic (addition, subtraction, multiplication, etc.) and with more sophisticated operations (trigonometric functions, exponential and logarithmic functions, etc.). Pandas inherits much of this functionality from NumPy, and the ufuncs that we introduced in Computation on NumPy Arrays: Universal Functions are key to this.</li>
    
    
<li>Pandas includes a couple useful twists, however: for unary operations like negation and trigonometric functions, these ufuncs will preserve index and column labels in the output, and for binary operations such as addition and multiplication, Pandas will automatically align indices when passing the objects to the ufunc. This means that keeping the context of data and combining data from different sources–both potentially error-prone tasks with raw NumPy arrays–become essentially foolproof ones with Pandas. We will additionally see that there are well-defined operations between one-dimensional Series structures and two-dimensional DataFrame structures.</li>





<h1>Features of Pandas</h1>

Pandas offers several features, some of the features offered by Pandas are:
<ul>
<li>Inserting and deleting columns in data structures.</li>
<li>Merging and joining data sets.</li>
<li>    Reshaping and pivoting data sets.</li>
<li>    Aligning data and dealing with missing data.</li>
<li>    Manipulating data using integrated indexing for DataFrame objects.</li>
<li>    Performing split-apply-combine on data sets using the group by engine.</li>
<li>    Manipulating high-dimensional data in a data structure with a lower dimension using hierarchical axis indexing.</li>
<li>    Subsetting, fancy indexing, and label-based slicing data sets that are large in size.</li>
<li>    Generating data range, converting frequency, date shifting, lagging, and other time-series functionality.</li>
<li>    Reading from files with CSV, XLSX, TXT, among other formats.</li>
<li>    Arranging data in an order ascending or descending.</li>
<li>    Filtering data around a condition.</li>
<li>    Iterating over a data set.</li>
 <li>   With Python Pandas, it is easier to clean and wrangle with data. Pandas Features like these make it a great choice for data science and analysis. Using it with libraries like NumPy and Matplotlib makes it all the more useful.</li>



</ul>

<h1>Datasets in Pandas</h1>

A data set (or dataset) is a collection of data. Most commonly a data set corresponds to the contents of a single database table, or a single statistical data matrix, where every column of the table represents a particular variable, and each row corresponds to a given member of the data set in question.

here in the example the furniture.csv is a dataset that is imported using read_csv function.

In [ ]:
import pandas as pd
location = 'C:/Users/Yaswanth/Documents/notebooks/furniture.csv' #Enter the location of the downloaded csv file.
furniture=pd.read_csv(location)
print(furniture)

Following are the Pandas dataset, let’s discuss them in detail:
<h2>a. Column names</h2>

The following command will give us all the column names-

In [ ]:
furniture=pd.read_csv(location)
(furniture.columns)

We can slice it-

In [ ]:
furniture=pd.read_csv(location)
print(furniture.columns[0:2])

<h2>b. Data types</h2>

In [ ]:
furniture=pd.read_csv(location)
print(furniture.dtypes)

<h1>Data types of one column</h1>

In [ ]:
furniture=pd.read_csv(location)
print(furniture['Brand'].dtypes)

<h2>c. Shape</h2>

In [ ]:
furniture=pd.read_csv(location)
(furniture.shape)

 <h2>d. Individual rows</h2>
 
 The head() method will give us the first 5 rows of the data set, but we can also choose to print fewer or more

In [ ]:
furniture=pd.read_csv(location)
(furniture.head(3))

<h2>e. Unique values</h2>

We can use the unique() function when we want to see what categories in the data set are unique.

In [ ]:
 furniture=pd.read_csv(location)
(furniture.index.unique())

<h2>f. NonUnique values</h2>

We can use the nunique() function when we want to see what categories in the data set are non-unique.

In [ ]:
 furniture=pd.read_csv(location)
(furniture.index.nunique())

<h1>Dataframes in Pandas</h1>

A DataFrame is an essential data structure with pandas. It lets us deal with data in a tabular fashion. The rows are observations and columns are variables.
We have the following syntax for this-

Such a data structure is-
<ul>
<li>Mutable</li>
<li>Variable columns</li>
<li>Labeled axes</li>
<li>Capable of performing arithmetic operations on columns and rows</li>

<h2>a. Creating a DataFrame</h2>

Let’s see how we can create a DataFrame

In [ ]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
print(df)

<h2>b. Setting Indexes for a DataFrame</h2>

Now this indexes the dataframe as integers starting at 0. But we can put labels on these. Let’s see how we can index it based on which company came first.

In [ ]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
df.index=['Third','Second','Fourth','Fifth','First']
df

<h2>c. Indexing a DataFrame</h2>

In [ ]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
df.index=['Third','Second','Fourth','Fifth','First']
df['company']

<h2>d. Slicing a DataFrame</h2>

It is possible to slice a DataFrame to retrieve rows from it.

In [ ]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
df.index=['Third','Second','Fourth','Fifth','First']
(df[0:3])

<h2>e. More data selection operations</h2>

Using loc and iloc, you can select certain rows in a data set. loc uses string indices; ilocuses integers.

In [ ]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
df.index=['Third','Second','Fourth','Fifth','First']
(df.loc['Second'])

<h1>Manipulating Datasets</h1>

So far, we have seen how we can find out more about a dataset (and also, how to set indexes to it, okay). Now let us see what we can do to it.

<h2>a. Changing the data type</h2>

let us use the furniture dataset for this by using astype function we can convert the datatype of particular column.</ul>

In [1]:
import pandas as pd
location = 'C:/Users/Yaswanth/Documents/notebooks/furniture.csv'
furniture=pd.read_csv(location)
(furniture.Cost.astype(float))

0    35000.0
1    50000.0
2    11000.0
3    19000.0
4     7777.0
Name: Cost, dtype: float64

<h2>b. Creating a frequency distribution</h2>

For creating a frequency distribution we use the method value_counts().

In [2]:
furniture=pd.read_csv(location)
furniture.index=['A','B','A','A','C']
(furniture.index.value_counts(ascending=True))

B    1
C    1
A    3
dtype: int64

<h2>c. Creating a crosstab</h2>

A crosstab creates a bivariate frequency distribution.

In [3]:
 furniture=pd.read_csv(location)
pd.crosstab(furniture.index,furniture.Brand)

Brand  Darien's  Doy's  Sam's  Stephen's
row_0
0             0      0      1          0
1             1      0      0          0
2             0      0      0          1
3             0      0      1          0
4             0      1      0          0

<h2>d. Choosing one column as index</h2>

You can choose one of the columns in your dataset to index others.

In [4]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
df.set_index('company',inplace=True)
(df)

                       CEO  Founded
company
Amazon          Jeff Bezos     1994
Apple             Tim Cook     1976
Google       Sundar Pichai     1998
Facebook   Mark Zuckerberg     2004
Microsoft    Satya Nadella     1975

<h2>e. Sorting data</h2>

For sorting the data we use the sort_values() function.

In [5]:
furniture=pd.read_csv(location)
(furniture.sort_values('Cost',ascending=False))

   Unnamed:  0       Product      Brand   Cost
1         1  2           Bed   Darien's  50000
0         0  1          Sofa      Sam's  35000
3         3  4  Coffee table      Sam's  19000
2         2  3    Nightstand  Stephen's  11000
4         4  5      Wall art      Doy's   7777

<h2>f. Renaming variables</h2>

We can rename the variables by using rename function.

In [6]:
furniture=pd.read_csv(location)
furniture.rename(columns={'Product':'Category'},inplace=True)
(furniture)

   Unnamed:  0      Category      Brand   Cost
0         0  1          Sofa      Sam's  35000
1         1  2           Bed   Darien's  50000
2         2  3    Nightstand  Stephen's  11000
3         3  4  Coffee table      Sam's  19000
4         4  5      Wall art      Doy's   7777

<h2>g. Dropping rows and columns</h2>

It is possible to drop any number of rows and columns you want.

In [7]:
furniture=pd.read_csv(location)
(furniture.drop('Cost',axis=1))

   Unnamed:  0       Product      Brand
0         0  1          Sofa      Sam's
1         1  2           Bed   Darien's
2         2  3    Nightstand  Stephen's
3         3  4  Coffee table      Sam's
4         4  5      Wall art      Doy's

<h2>h. Creating new variables</h2>

Now, let us add 10% of the cost to itself and find out the gross amount.

In [8]:
furniture=pd.read_csv(location)
furniture['Gross']=furniture.eval('Cost+(Cost*(0.1))')
(furniture)

   Unnamed:  0       Product      Brand   Cost    Gross
0         0  1          Sofa      Sam's  35000  38500.0
1         1  2           Bed   Darien's  50000  55000.0
2         2  3    Nightstand  Stephen's  11000  12100.0
3         3  4  Coffee table      Sam's  19000  20900.0
4         4  5      Wall art      Doy's   7777   8554.7

<h1>Describing a Dataset</h1>

Here, with the describe() method, we can find out information about a dataset- min, max, mean, count, and more.

In [9]:
furniture=pd.read_csv(location)
(furniture.describe())

       Unnamed:         0        Cost
count  5.000000  5.000000      5.0000
mean   2.000000  3.000000  24555.4000
std    1.581139  1.581139  17696.3512
min    0.000000  1.000000   7777.0000
25%    1.000000  2.000000  11000.0000
50%    2.000000  3.000000  19000.0000
75%    3.000000  4.000000  35000.0000
max    4.000000  5.000000  50000.0000

<h1>Some of useful funtions in Pandas.</h1>

Pandas provides different functions that helps in data manipulation.

<h1>Groupby function</h1>

Generally, this operation lets you group data on a variable.

In [10]:
location = 'C:/Users/Yaswanth/Documents/notebooks/furniture.csv' #Enter the location of the downloaded csv file.
furniture=pd.read_csv(location)
(furniture.groupby('Product').Cost.min())

Product
Bed             50000
Coffee table    19000
Nightstand      11000
Sofa            35000
Wall art         7777
Name: Cost, dtype: int64

<h1> agg() function</h1>

The agg() function lets us find out different values like count and min.

In [11]:
furniture=pd.read_csv(location)
(furniture.agg(['count','min','max','mean']))

       Unnamed:    0   Product      Brand     Cost
count       5.0  5.0         5          5      5.0
min         0.0  1.0       Bed   Darien's   7777.0
max         4.0  5.0  Wall art  Stephen's  50000.0
mean        2.0  3.0       NaN        NaN  24555.4

<h1>Rank function</h1>

Now, to rank every variable according to its value, we can use rank() function.

In [12]:
furniture=pd.read_csv(location)
furniture.rank()
(furniture)

   Unnamed:  0       Product      Brand   Cost
0         0  1          Sofa      Sam's  35000
1         1  2           Bed   Darien's  50000
2         2  3    Nightstand  Stephen's  11000
3         3  4  Coffee table      Sam's  19000
4         4  5      Wall art      Doy's   7777

<h1>Concatenating DataFrames</h1>
<ul>
<li>The concat() method is used to concatenate two or more DataFrames.</li>
<li>We pass the parameter sort=False in order to eliminate the warnings occured during the concatination of unaligned dataframes.</li>
</ul>

In [13]:
df=pd.DataFrame({'company':['Amazon','Apple','Google','Facebook','Microsoft'],'CEO':['Jeff Bezos','Tim Cook','Sundar Pichai','Mark Zuckerberg','Satya Nadella'],'Founded':[1994,1976,1998,2004,1975]})
furniture=pd.read_csv(location)
(pd.concat([df,furniture],sort=False))

,company,CEO,Founded,Unnamed:,0,Product,Brand,Cost
0,Amazon,Jeff Bezos,1994.0,NaN,NaN,NaN,NaN,NaN
1,Apple,Tim Cook,1976.0,NaN,NaN,NaN,NaN,NaN
2,Google,Sundar Pichai,1998.0,NaN,NaN,NaN,NaN,NaN
3,Facebook,Mark Zuckerberg,2004.0,NaN,NaN,NaN,NaN,NaN
4,Microsoft,Satya Nadella,1975.0,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,0.0,1.0,Sofa,Sam's,35000.0
1,NaN,NaN,NaN,1.0,2.0,Bed,Darien's,50000.0
2,NaN,NaN,NaN,2.0,3.0,Nightstand,Stephen's,11000.0
3,NaN,NaN,NaN,3.0,4.0,Coffee table,Sam's,19000.0
4,NaN,NaN,NaN,4.0,5.0,Wall art,Doy's,7777.0

<h1>Filtering</h1>

The filtering helps in removal of unnecessary data from the whole data.

In [14]:
furniture=pd.read_csv(location)
(furniture[furniture.index==2])

   Unnamed:  0     Product      Brand   Cost
2         2  3  Nightstand  Stephen's  11000

<h1>Missing values</h1>

In order to find the missing values in the data we use isnull()

In [15]:
furniture=pd.read_csv(location)
(furniture.isnull())

   Unnamed:      0  Product  Brand   Cost
0     False  False    False  False  False
1     False  False    False  False  False
2     False  False    False  False  False
3     False  False    False  False  False
4     False  False    False  False  False